[
    {
        "quiz": "Imagine you're in a new city. What grabs your attention first?",
        "answers": [
            {
                "answerText": "A. Bustling market: Exotic smells and vibrant sights will draw me in.",
                "answerType": 1
            },
            {
                "answerText": "B. Charming cafes and bakeries: Warm ambiance and familiar comforts beckon.",
                "answerType": 2
            }
        ]
    },
    {
        "quiz": "Now that you're hungry, what do you crave?",
        "answers": [
            {
                "answerText": "A. Local specialty: I want to experience authentic flavors.",
                "answerType": 2
            },
            {
                "answerText": "B. Something unique and unfamiliar: I’m down for an adventurous culinary journey.",
                "answerType": 1
            }
        ]
    },
    {
        "quiz": "It's time to find a souvenir. What catches your eye?",
        "answers": [
            {
                "answerText": "A. A wacky, one-of-a-kind trinket: It's gotta be something nobody else has!",
                "answerType": 1
            },
            {
                "answerText": "B. A beautiful, handcrafted item from local artisans.",
                "answerType": 2
            }
        ]
    },
    {
        "quiz": "Back in your hotel room, what sets your mood?",
        "answers": [
            {
                "answerText": "A. High-energy playlist: Pump it up with driving rhythms and powerful vocals!",
                "answerType": 0
            },
            {
                "answerText": "B. Calming melodies: Let’s unwind with soothing tunes that melt the day's stress.",
                "answerType": 2
            }
        ]
    },
    {
        "quiz": "Let's talk dinner! Which dish sounds more tempting to you?",
        "answers": [
            {
                "answerText": "A. Fiery Feast: A sizzling dish bursting with bold flavors and a kick of heat that will tantalize my taste buds.",
                "answerType": 0
            },
            {
                "answerText": "B. Flavorful Fusion: A dish that combines familiar comfort with a touch of exciting spice for a harmonious blend.",
                "answerType": 2
            }
        ]
    },
    {
        "quiz": "Time for dessert! What tempts your taste buds?",
        "answers": [
            {
                "answerText": "A. Something intense and unexpected. Surprise me with bold flavors and contrasting textures!",
                "answerType": 0
            },
            {
                "answerText": "B. Light and refreshing, please! Keep it sweet and simple for the perfect ending.",
                "answerType": 2
            }
        ]
    },
    {
        "quiz": "Waking up next morning, how do you jumpstart your day?",
        "answers": [
            {
                "answerText": "A. Spicy breakfast burrito: A fiery kick gets my engine going!",
                "answerType": 0
            },
            {
                "answerText": "B. Classic breakfast routine: Familiar flavors fuel my mornings.",
                "answerType": 2
            }
        ]
    },
    {
        "quiz": "You are going for a walk, how do you like to explore the local scene?",
        "answers": [
            {
                "answerText": "A. Trendy Hotspot: Dive into the hottest new destinations and snap envy-worthy selfies to document the adventures.",
                "answerType": 1
            },
            {
                "answerText": "B. Hidden Gem: Seek out unique spots for photos that capture the city's authentic vibe.",
                "answerType": 2
            }
        ]
    },
    {
        "quiz": "As the sun sets, how do you enjoy the nightlife?",
        "answers": [
            {
                "answerText": "A. Thrilling Thump: Hit up a club with electrifying music and vibrant crowds!",
                "answerType": 0
            },
            {
                "answerText": "B. Chill Corner: Find a cozy bar with live music for a relaxed evening.",
                "answerType": 2
            }
        ]
    },
    {
        "quiz": "As your taxi pulls away, what memory flashes brightest?",
        "answers": [
            {
                "answerText": "A. Striking up a conversation with a local and having a hilarious and unexpected encounter",
                "answerType": 1
            },
            {
                "answerText": "B. Conquering a thrilling activity that left me exhilarated and a little shaken.",
                "answerType": 0
            }
        ]
    }
]